Revit 2027 API
ExporterIFCUtils.HasElevationProfile Method
 Identifies if the wall has a sketched elevation profile.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool HasElevationProfile(
	Wall pVWall
)
Public Shared Function HasElevationProfile (
	pVWall As Wall
) As Boolean
public:
static bool HasElevationProfile(
	Wall^ pVWall
)
static member HasElevationProfile :
        pVWall : Wall -> bool
Parameters
pVWall Wall
 The wall.
Return Value
Boolean
 True if the wall has a sketch elevation profile, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ExporterIFCUtils Class
Autodesk.Revit.DB.IFC Namespace